[
    {
      "name": "Skräddarsydd rådgivning för internationella äventyr",
      "description": "Jag har haft glädjen att hjälpa hundratals studenter att hitta det perfekta utbytesprogrammet baserat på deras akademiska mål och personliga intressen. Ett av mina mest givande projekt var att utveckla en skräddarsydd rådgivningsprocess där jag, genom djupa samtal och personlig analys, matchade varje student med det program som bäst passade deras ambitioner. Detta ledde till att flera studenter hittade okonventionella program och upplevelser som förändrade deras framtid på sätt de aldrig hade kunnat förutse."
    },
    {
      "name": "Framtagning av ett interaktivt vägledningsverktyg",
      "description": "Som en del av mitt arbete skapade jag ett interaktivt onlineverktyg som hjälper studenter att utforska olika utbytesprogram baserat på deras intressen, karriärmål och önskemål om destinationer. Genom att svara på några enkla frågor får studenterna direkt en lista med rekommenderade program som de kan utforska vidare. Detta verktyg har varit ovärderligt för studenter som är osäkra på vilket program som bäst passar deras behov, och det har gjort rådgivningsprocessen både roligare och mer engagerande."
    },
    {
      "name": "Workshops om att hitta rätt utbytesprogram",
      "description": "Jag organiserade en serie workshops för studenter som ville få en bättre förståelse för hur man hittar det bästa utbytesprogrammet. Under dessa workshops gick jag igenom olika aspekter att tänka på, som akademiska krav, språkkunskaper, kulturella skillnader och praktiska överväganden som budget och boende. Det var fantastiskt att se hur studenter som kom till workshopen utan någon klar idé om vad de ville göra lämnade med en tydlig plan och en gnista av entusiasm för sitt kommande äventyr."
    },
    {
      "name": "Individuell stöd genom hela ansökningsprocessen",
      "description": "Ansökningsprocessen till utbytesprogram kan vara överväldigande, och jag är stolt över att ha hjälpt studenter genom varje steg. Från att samla in nödvändiga dokument och skriva personliga brev, till att förbereda sig för intervjuer och hantera deadlines. Ett av de mest minnesvärda projekten var att skapa en steg-för-steg-guide som bröt ner ansökningsprocessen i hanterbara bitar, vilket hjälpte studenter att minska stressen och säkerställde att de hade allt de behövde för att lyckas."
    },
    {
      "name": "Mentorskap för tidigare utbytesstudenter",
      "description": "Ett av de projekt jag brinner mest för är mentorsprogrammet jag startade, där tidigare utbytesstudenter blir mentorer för nya studenter som ska ut på sina egna äventyr. Mentorerna delar med sig av sina erfarenheter och ger praktiska tips om allt från att navigera nya kulturer till att hantera hemlängtan. Jag matchade varje student med en mentor som hade erfarenhet av samma program eller destination, vilket skapade en stark gemenskap och en ovärderlig stödstruktur för våra studenter."
    }
  ]
  
  